CompilingCustomSolver/mixerVesselAMI2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    rotor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       5856;
    }
    stator
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       6048;
    }
    AMI1
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          96;
        startFace       6240;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI2;
    }
    AMI2
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          96;
        startFace       6336;
        matchTolerance  0.0001;
        transform       noOrdering;
        neighbourPatch  AMI1;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3072;
        startFace       6432;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3072;
        startFace       9504;
    }
)

// ************************************************************************* //
